app/controllers/plant_tags_controller.rb

    def new
        @plant = Plant.find(params[:plant_id])
        @plant_tag = PlantTag.new
        @tags = Tag.all
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tags".* FROM "tags"

    def create
        @plant = Plant.find(params[:plant_id])
        @tags = Tag.where(id: params[:plant_tag][:tag])
        @tags.each do |tag|
            @plant_tag = PlantTag.new(plant: @plant, tag: tag)
            @plant_tag.save
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (?, ?, ?, ?)  [["id", nil], ["id", 3], ["id", 4], ["id", 5]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (?, ?, ?)  [["id", nil], ["id", 3], ["id", 4]]
INSERT INTO "plant_tags" ("plant_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["plant_id", 1], ["tag_id", 3], ["created_at", "2020-10-17 13:52:00.384662"], ["updated_at", "2020-10-17 13:52:00.384662"]]